#### 📖 Terraform Plan -> deploy-kubernetes-infra

<details><summary>Clique para ver os detalhes</summary>

```terraform
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/FIAP-SOAT-ORG/fiap-soat-cluster/runs/run-uGVTqTH5bF13KYL3

Waiting for the plan to start...

Terraform v1.14.0
on linux_amd64
Initializing plugins and modules...
data.terraform_remote_state.database: Refreshing...
module.eks.module.kms.data.aws_caller_identity.current[0]: Refreshing...
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/fiap-soat-cluster/cluster]
module.eks.data.aws_partition.current: Refreshing...
aws_ecr_repository.app_repo: Refreshing state... [id=fiap-soat-app]
module.eks.module.eks_managed_node_group["default"].data.aws_partition.current: Refreshing...
module.eks.module.eks_managed_node_group["default"].data.aws_caller_identity.current: Refreshing...
module.eks.module.kms.data.aws_partition.current[0]: Refreshing...
module.eks.data.aws_caller_identity.current: Refreshing...
module.eks.module.eks_managed_node_group["default"].data.aws_partition.current: Refresh complete after 0s [id=aws]
module.eks.module.kms.data.aws_partition.current[0]: Refresh complete after 0s [id=aws]
module.eks.data.aws_partition.current: Refresh complete after 0s [id=aws]
module.eks.module.eks_managed_node_group["default"].data.aws_iam_policy_document.assume_role_policy[0]: Refreshing...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Refreshing...
module.eks.module.kms.data.aws_caller_identity.current[0]: Refresh complete after 0s [id=016804998405]
module.eks.module.eks_managed_node_group["default"].data.aws_iam_policy_document.assume_role_policy[0]: Refresh complete after 0s [id=2560088296]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Refresh complete after 0s [id=2764486067]
module.eks.module.eks_managed_node_group["default"].aws_iam_role.this[0]: Refreshing state... [id=default-eks-node-group-20260104175628349400000001]
module.eks.aws_iam_role.this[0]: Refreshing state... [id=fiap-soat-cluster-cluster-20260104175628349700000003]
module.eks.module.eks_managed_node_group["default"].data.aws_caller_identity.current: Refresh complete after 0s [id=016804998405]
module.eks.data.aws_caller_identity.current: Refresh complete after 0s [id=016804998405]
module.eks.data.aws_iam_session_context.current: Refreshing...
module.eks.data.aws_iam_session_context.current: Refresh complete after 0s [id=arn:aws:iam::016804998405:user/github]
module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=default-eks-node-group-20260104175628349400000001-20260104175628659300000005]
module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=default-eks-node-group-20260104175628349400000001-20260104175628720100000006]
module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=default-eks-node-group-20260104175628349400000001-20260104175628880100000009]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=fiap-soat-cluster-cluster-20260104175628349700000003-20260104175628767800000007]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=fiap-soat-cluster-cluster-20260104175628349700000003-20260104175628768200000008]
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Refreshing...
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Refresh complete after 0s [id=221977848]
module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=1200da81-f6f0-43ce-a9b7-cfaf18fbfea9]
data.terraform_remote_state.database: Refresh complete after 0s
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0e51efc3b3e43e888]
module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-0a54728ac89546961]
module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/fiap-soat-cluster]
module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::016804998405:policy/fiap-soat-cluster-cluster-ClusterEncryption2026010417565754120000000a]
module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=fiap-soat-cluster-cluster-20260104175628349700000003-2026010417565776800000000b]
module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-1536169954]
module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-2463264884]
module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-946368398]
module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-1862130006]
module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-2886210443]
module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-3399645881]
module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-264008153]
module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-3845095326]
module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-2173586517]
module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-2002812465]
module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-1682144065]
aws_ecr_repository.app_repo: Drift detected (update)
module.eks.aws_security_group.cluster[0]: Drift detected (update)
module.eks.aws_iam_role.this[0]: Drift detected (update)
module.eks.aws_security_group.node[0]: Drift detected (update)
module.eks.aws_iam_policy.cluster_encryption[0]: Drift detected (update)
module.eks.module.eks_managed_node_group["default"].aws_iam_role.this[0]: Drift detected (update)
╷
│ Warning: Deprecated Resource
│
│   with module.eks.kubernetes_config_map.aws_auth,
│   on .terraform/modules/eks/main.tf line 545, in resource "kubernetes_config_map" "aws_auth":
│  545: resource "kubernetes_config_map" "aws_auth" {
│
│ Deprecated; use kubernetes_config_map_v1.
╵
╷
│ Warning: Argument is deprecated
│
│   with module.eks.aws_iam_role.this[0],
│   on .terraform/modules/eks/main.tf line 293, in resource "aws_iam_role" "this":
│  293: resource "aws_iam_role" "this" {
│
│ inline_policy is deprecated. Use the aws_iam_role_policy resource instead.
│ If Terraform should exclusively manage all inline policy associations (the
│ current behavior of this argument), use the aws_iam_role_policies_exclusive
│ resource as well.
╵

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.eks.data.tls_certificate.this[0] will be read during apply
 <= data "tls_certificate" "this" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.eks.aws_ec2_tag.cluster_primary_security_group["Environment"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "Environment"
      + resource_id = (known after apply)
      + value       = "prod"
    }

  # module.eks.aws_ec2_tag.cluster_primary_security_group["Project"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "Project"
      + resource_id = (known after apply)
      + value       = "FIAP-SOAT"
    }

  # module.eks.aws_eks_cluster.this[0] will be created
  + resource "aws_eks_cluster" "this" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + enabled_cluster_log_types     = [
          + "api",
          + "audit",
          + "authenticator",
        ]
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "fiap-soat-cluster"
      + platform_version              = (known after apply)
      + role_arn                      = "arn:aws:iam::016804998405:role/fiap-soat-cluster-cluster-20260104175628349700000003"
      + status                        = (known after apply)
      + tags                          = {
          + "Environment" = "prod"
          + "Project"     = "FIAP-SOAT"
        }
      + tags_all                      = {
          + "Environment" = "prod"
          + "Project"     = "FIAP-SOAT"
        }
      + version                       = "1.27"

      + access_config (known after apply)

      + encryption_config {
          + resources = [
              + "secrets",
            ]

          + provider {
              + key_arn = "arn:aws:kms:us-east-1:016804998405:key/1200da81-f6f0-43ce-a9b7-cfaf18fbfea9"
            }
        }

      + kubernetes_network_config {
          + ip_family         = (known after apply)
          + service_ipv4_cidr = (known after apply)
          + service_ipv6_cidr = (known after apply)

          + elastic_load_balancing (known after apply)
        }

      + timeouts {}

      + upgrade_policy (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = [
              + "sg-0e51efc3b3e43e888",
            ]
          + subnet_ids                = [
              + "subnet-001716512062e9369",
              + "subnet-031806075f479902e",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_iam_openid_connect_provider.oidc_provider[0] will be created
  + resource "aws_iam_openid_connect_provider" "oidc_provider" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "Environment" = "prod"
          + "Name"        = "fiap-soat-cluster-eks-irsa"
          + "Project"     = "FIAP-SOAT"
        }
      + tags_all        = {
          + "Environment" = "prod"
          + "Name"        = "fiap-soat-cluster-eks-irsa"
          + "Project"     = "FIAP-SOAT"
        }
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # module.eks.time_sleep.this[0] will be created
  + resource "time_sleep" "this" {
      + create_duration = "30s"
      + id              = (known after apply)
      + triggers        = {
          + "cluster_certificate_authority_data" = (known after apply)
          + "cluster_endpoint"                   = (known after apply)
          + "cluster_name"                       = "fiap-soat-cluster"
          + "cluster_version"                    = "1.27"
        }
    }

  # module.eks.module.eks_managed_node_group["default"].aws_eks_node_group.this[0] will be created
  + resource "aws_eks_node_group" "this" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = "fiap-soat-cluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.medium",
        ]
      + node_group_name        = (known after apply)
      + node_group_name_prefix = "default-"
      + node_role_arn          = "arn:aws:iam::016804998405:role/default-eks-node-group-20260104175628349400000001"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-001716512062e9369",
          + "subnet-031806075f479902e",
        ]
      + tags                   = {
          + "Environment" = "prod"
          + "Name"        = "default"
          + "Project"     = "FIAP-SOAT"
        }
      + tags_all               = {
          + "Environment" = "prod"
          + "Name"        = "default"
          + "Project"     = "FIAP-SOAT"
        }
      + version                = "1.27"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + node_repair_config (known after apply)

      + scaling_config {
          + desired_size = 1
          + max_size     = 2
          + min_size     = 1
        }

      + timeouts {}

      + update_config {
          + max_unavailable_percentage = 33
        }
    }

  # module.eks.module.eks_managed_node_group["default"].aws_launch_template.this[0] will be created
  + resource "aws_launch_template" "this" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + description            = "Custom launch template for default EKS managed node group"
      + id                     = (known after apply)
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "default-"
      + tags                   = {
          + "Environment" = "prod"
          + "Project"     = "FIAP-SOAT"
        }
      + tags_all               = {
          + "Environment" = "prod"
          + "Project"     = "FIAP-SOAT"
        }
      + update_default_version = true
      + vpc_security_group_ids = [
          + "sg-0a54728ac89546961",
        ]
        # (2 unchanged attributes hidden)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = 2
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + monitoring {
          + enabled = true
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Environment" = "prod"
              + "Name"        = "default"
              + "Project"     = "FIAP-SOAT"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "Environment" = "prod"
              + "Name"        = "default"
              + "Project"     = "FIAP-SOAT"
            }
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "Environment" = "prod"
              + "Name"        = "default"
              + "Project"     = "FIAP-SOAT"
            }
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @GustaSchmidt, Action: `pull_request`*